wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/src/crypto.c
    /* Update pCurve pointer */
    err = ecc_init_curve(crypto, ecc_curve);
    if(err == 0)
    {
        /* get curve */
        memcpy(curve, pCurve, sizeof(ECC_CURVE));
    }

    return err;
}

static int  get_nibble_value(char c)
{
    if ((c >= '0') && (c <= '9'))
    {
        c = c - '0';
    }

    if ((c >= 'a') && (c <= 'f'))
    {
        c = c - 'a' + (char)10;
    }

    if ((c >= 'A') && (c <= 'F'))
    {
        c = c - 'A' + (char)10;
    }
    return (int)c;
}

int ecc_strcmp(char *s1, char *s2)
{
    char  c1, c2;

    while (*s1 == '0') s1++;
    while (*s2 == '0') s2++;

    for ( ; *s1 || *s2; s1++, s2++)
    {
        if ((*s1 >= 'A') && (*s1 <= 'Z'))
            c1 = *s1 + 32;
        else
            c1 = *s1;

        if ((*s2 >= 'A') && (*s2 <= 'Z'))
            c2 = *s2 + 32;
        else
            c2 = *s2;

        if (c1 != c2)
            return 1;
    }
    return 0;
}

volatile uint32_t g_ECC_done, g_ECCERR_done;

/** @endcond HIDDEN_SYMBOLS */

/**
  * @brief  ECC interrupt service routine. User application must invoke this function in
  *         his CRYPTO_IRQHandler() to let Crypto driver know ECC processing was done.
  * @param[in]  crypto        Reference to Crypto module.
  * @return   none
  */
void ECC_Complete(CRYPTO_T *crypto)
{
    if (crypto->INTSTS & CRYPTO_INTSTS_ECCIF_Msk)
    {
        g_ECC_done = 1UL;
        crypto->INTSTS = CRYPTO_INTSTS_ECCIF_Msk;
        printf("ECC done IRQ.\n");
    }

    if (crypto->INTSTS & CRYPTO_INTSTS_ECCEIF_Msk)
    {
        g_ECCERR_done = 1UL;
        crypto->INTSTS = CRYPTO_INTSTS_ECCEIF_Msk;
        printf("ECCERRIF is set!!\n");
        printf("ECC_STS = 0x%x\n", crypto->ECC_STS);
        while (1);
    }
}

void ECC_Start(uint32_t ecc_ctl)
{
    g_ECC_done = g_ECCERR_done = 0UL;
    CRYPTO->ECC_CTL |= ecc_ctl;
    
    while ((g_ECC_done== 0UL) && (g_ECCERR_done== 0UL))
    {
        printf("ECC_start\n");
    }
}

/**
  * @brief  Check if the private key is located in valid range of curve.
  * @param[in]  crypto        Reference to Crypto module.
  * @param[in]  ecc_curve   The pre-defined ECC curve.
  * @param[in]  private_k   The input private key.
  * @return  1    Is valid.
  * @return  0    Is not valid.
  * @return  -1   Invalid curve.
  */
int ECC_IsPrivateKeyValid(CRYPTO_T *crypto, E_ECC_CURVE ecc_curve, char private_k[])
{
    uint32_t  i;
    int       ret = -1;

    pCurve = get_curve(ecc_curve);
    if (pCurve == NULL)
    {
        ret = -1;
    }

    if (__strlen(private_k) < __strlen(pCurve->Eorder))
    {
        ret = 1;
    }

    if (__strlen(private_k) > __strlen(pCurve->Eorder))
    {
        ret = 0;
    }

    for (i = 0UL; i < __strlen(private_k); i++)
    {
        if (get_nibble_value(private_k[i]) < get_nibble_value(pCurve->Eorder[i]))
        {
            ret = 1;
            break;
        }
        if (get_nibble_value(private_k[i]) > get_nibble_value(pCurve->Eorder[i]))
        {
            ret = 0;
            break;
        }
    }
    return ret;
}

/**
  * @brief  Given a private key and curve to generate the public key pair.
  * @param[in]  crypto        Reference to Crypto module.
  * @param[in]  private_k   The input private key.
  * @param[in]  ecc_curve   The pre-defined ECC curve.
  * @param[out] public_k1   The output public key 1.
  * @param[out] public_k2   The output public key 2.
  * @return  0    Success.
  * @return  -1   "ecc_curve" value is invalid.
  */
int32_t  ECC_GeneratePublicKey(CRYPTO_T *crypto, E_ECC_CURVE ecc_curve, char *private_k, char public_k1[], char public_k2[])
{
    int32_t  i, ret = 0;

    if (ecc_init_curve(crypto, ecc_curve) != 0)
    {
        ret = -1;
    }

    if (ret == 0)
    {
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_K[i] = 0UL;
        }
        Hex2Reg(private_k, crypto->ECC_K);

        /* set FSEL (Field selection) */
        if (pCurve->GF == (int)CURVE_GF_2M)
        {
            crypto->ECC_CTL = 0UL;
        }
        else
        {
            /*  CURVE_GF_P */
            crypto->ECC_CTL = CRYPTO_ECC_CTL_FSEL_Msk;
        }

        for (i = 0; i < 18; i++)
        {
            crypto->ECC_X2[i] = 0UL;
        }
        Hex2Reg(pCurve->Eorder, crypto->ECC_X2);

        if  (ecc_curve == CURVE_25519)
        {
            // dump_ecc_reg("CRYPTO_ECC_POINT_X2", crypto->ECC_X2, 10);
            // crypto->ECC_CTL |= CRYPTO_ECC_CTL_SCAP_Msk;
            crypto->ECC_CTL |= CRYPTO_ECC_CTL_SPCEN_Msk;
        }

        /* enable side-channel attack protection */
        crypto->ECC_CTL |= CRYPTO_ECC_CTL_SCAP_Msk | CRYPTO_ECC_CTL_ASCAP_Msk;

        g_ECC_done = g_ECCERR_done = 0UL;
        crypto->ECC_CTL |= ((uint32_t)pCurve->key_len << CRYPTO_ECC_CTL_CURVEM_Pos) |
                           ECCOP_POINT_MUL | CRYPTO_ECC_CTL_PFA2C_Msk | CRYPTO_ECC_CTL_START_Msk;

        while ((g_ECC_done== 0UL) && (g_ECCERR_done== 0UL))
        {
            printf("ECC_start\n");
        }

        Reg2Hex(pCurve->Echar, crypto->ECC_X1, public_k1);
        Reg2Hex(pCurve->Echar, crypto->ECC_Y1, public_k2);
    }

    return ret;
}

/**
  * @brief  Given a private key from Key Store to generate the public key pair.
  * @param[in]  crypto        Reference to Crypto module.
  * @param[in]  ecc_curve   The pre-defined ECC curve.
  * @param[in]  k_ksnum     k_ksnum >= 0x80: Use Key Store OTP key number "k_ksnum - 0x80" as input private key
  *                         k_ksnum >= 0:    Use Key Store SRAM key number k_ksnum as input private key
  * @param[in]  is_ecdh     Key Store key was written with ECDH bit enable
  * @param[out] public_k1   The output public key 1.
  * @param[out] public_k2   The output public key 2.
  * @return  0    Success.
  * @return  -1   "ecc_curve" value is invalid.
  */
int32_t  ECC_GeneratePublicKey_KS(CRYPTO_T *crypto, E_ECC_CURVE ecc_curve, int k_ksnum, int is_ecdh, char public_k1[], char public_k2[])
{
    int32_t  i, ret = 0;

    if (ecc_init_curve(crypto, ecc_curve) != 0)
    {
        ret = -1;
    }

    if (ret == 0)
    {
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_K[i] = 0UL;
        }
        if (k_ksnum >= 0x80)
        {
            if (is_ecdh)
                crypto->ECC_KSCTL = (0x2UL<<CRYPTO_ECC_KSCTL_RSSRCK_Pos) | CRYPTO_ECC_KSCTL_ECDH_Msk |
                                    CRYPTO_ECC_KSCTL_RSRCK_Msk | (k_ksnum - 0x80);
            else
                crypto->ECC_KSCTL = (0x2UL<<CRYPTO_ECC_KSCTL_RSSRCK_Pos) |
                                    CRYPTO_ECC_KSCTL_RSRCK_Msk | (k_ksnum - 0x80);
        }
        else
        {
            if (is_ecdh)
                crypto->ECC_KSCTL = (0<<CRYPTO_ECC_KSCTL_RSSRCK_Pos) | CRYPTO_ECC_KSCTL_ECDH_Msk |
                                    CRYPTO_ECC_KSCTL_RSRCK_Msk | (k_ksnum);
            else
                crypto->ECC_KSCTL = (0<<CRYPTO_ECC_KSCTL_RSSRCK_Pos) |
                                    CRYPTO_ECC_KSCTL_RSRCK_Msk | (k_ksnum);
        }

