wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/src/crypto.c
        g_ECC_done = g_ECCERR_done = 0UL;
        crypto->ECC_CTL |= ((uint32_t)pCurve->key_len << CRYPTO_ECC_CTL_CURVEM_Pos) |
                           ECCOP_POINT_MUL | CRYPTO_ECC_CTL_START_Msk;

        while ((g_ECC_done== 0UL) && (g_ECCERR_done== 0UL))
        {
        }
        crypto->ECC_KSCTL = 0;
        crypto->ECC_KSXY = 0;

        Reg2Hex(pCurve->Echar, crypto->ECC_X1, x2);
        Reg2Hex(pCurve->Echar, crypto->ECC_Y1, y2);
    }

    return ret;
}

/**
  * @brief  Given a curve parameter, the other party's public key, and one's own private key to generate the secret Z.
  * @param[in]  crypto        Reference to Crypto module.
  * @param[in]  ecc_curve   The pre-defined ECC curve.
  * @param[in]  private_k   One's own private key.
  * @param[in]  public_k1   The other party's publick key 1.
  * @param[in]  public_k2   The other party's publick key 2.
  * @param[out] secret_z    The ECC CDH secret Z.
  * @return  0    Success.
  * @return  -1   "ecc_curve" value is invalid.
  */
int32_t  ECC_GenerateSecretZ(CRYPTO_T *crypto, E_ECC_CURVE ecc_curve, char *private_k, char public_k1[], char public_k2[], char secret_z[])
{
    int32_t  i, ret = 0;

    if (ecc_init_curve(crypto, ecc_curve) != 0)
    {
        ret = -1;
    }

    if (ret == 0)
    {
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_K[i] = 0UL;
            crypto->ECC_X1[i] = 0UL;
            crypto->ECC_Y1[i] = 0UL;
            crypto->ECC_X2[i] = 0UL;
        }

        if ((ecc_curve == CURVE_B_163) || (ecc_curve == CURVE_B_233) || (ecc_curve == CURVE_B_283) ||
                (ecc_curve == CURVE_B_409) || (ecc_curve == CURVE_B_571) || (ecc_curve == CURVE_K_163))
        {
            Hex2RegEx(private_k, crypto->ECC_K, 1);
        }
        else if ((ecc_curve == CURVE_K_233) || (ecc_curve == CURVE_K_283) ||
                 (ecc_curve == CURVE_K_409) || (ecc_curve == CURVE_K_571))
        {
            Hex2RegEx(private_k, crypto->ECC_K, 2);
        }
        else
        {
            Hex2Reg(private_k, crypto->ECC_K);
        }

        Hex2Reg(public_k1, crypto->ECC_X1);
        Hex2Reg(public_k2, crypto->ECC_Y1);

        /* set FSEL (Field selection) */
        if (pCurve->GF == (int)CURVE_GF_2M)
        {
            crypto->ECC_CTL = 0UL;
        }
        else
        {
            /*  CURVE_GF_P */
            crypto->ECC_CTL = CRYPTO_ECC_CTL_FSEL_Msk;
        }
        g_ECC_done = g_ECCERR_done = 0UL;
        crypto->ECC_CTL |= ((uint32_t)pCurve->key_len << CRYPTO_ECC_CTL_CURVEM_Pos) |
                           ECCOP_POINT_MUL | CRYPTO_ECC_CTL_START_Msk;

        while ((g_ECC_done== 0UL) && (g_ECCERR_done== 0UL))
        {
        }

        Reg2Hex(pCurve->Echar, crypto->ECC_X1, secret_z);
    }

    return ret;
}


/**
  * @brief  Given a curve parameter, the other party's public key, and one's own private key to generate the secret Z.
  * @param[in]  crypto        Reference to Crypto module.
  * @param[in]  ecc_curve   The pre-defined ECC curve.
  * @param[in]  k_ksnum     -1:  do not use Key Store, instead, use <private_k> as input private key
  *                         k_ksnum >= 0x80: Use Key Store OTP key number "k_ksnum - 0x80" as input private key
  *                         k_ksnum >= 0:    Use Key Store SRAM key number k_ksnum as input private key
  * @param[in]  private_k   One's own private key.
  * @param[in]  public_x    The other party's publick key x.
  * @param[in]  public_y    The other party's publick key y.
  * @param[in]  z_to_ks     0: Do not write output secret to Key Store
  *                         1: Write output secret to Key Store OTP
  *                         2: Write output secret to Key Store SRAM
  * @param[in]  z_owner     The owner of secret Z in Key Store. Only valid when <z_to_ks> is not 0.
  *                         0: Owner is AES
  *                         1: Owner is HMAC
  *                         4: Owner is ECC
  *                         5: Owner is CPU
  *
  * @param[out] secret_z    The ECC CDH secret Z.
  * @return  > 0     Secret Z output to Key Store. The key number.
  * @return  = 0     Success.
  * @return  < 0     "ecc_curve" value is invalid.
  */
int32_t  ECC_GenerateSecretZ_KS(CRYPTO_T *crypto, E_ECC_CURVE ecc_curve, int k_ksnum, char *private_k,
                                char public_x[], char public_y[],
                                int z_to_ks, int z_owner, char secret_z[])
{
    int32_t    i;
    uint32_t   ecc_ksctl;

    if (ecc_init_curve(crypto, ecc_curve) != 0)
    {
        return -1;
    }

    ecc_ksctl = CRYPTO_ECC_KSCTL_ECDH_Msk;

    for (i = 0; i < 18; i++)
    {
        crypto->ECC_K[i] = 0UL;
        crypto->ECC_X1[i] = 0UL;
        crypto->ECC_Y1[i] = 0UL;
    }

    if (k_ksnum >= 0x80)
    {
        ecc_ksctl |= (0x2<<CRYPTO_ECC_KSCTL_RSSRCK_Pos) |
                     CRYPTO_ECC_KSCTL_RSRCK_Msk | (k_ksnum - 0x80);
    }
    else if (k_ksnum >= 0)
    {
        ecc_ksctl |= (0<<CRYPTO_ECC_KSCTL_RSSRCK_Pos) |
                     CRYPTO_ECC_KSCTL_RSRCK_Msk | (k_ksnum);
    }
#if 0
    else if ((ecc_curve == CURVE_B_163) || (ecc_curve == CURVE_B_233) || (ecc_curve == CURVE_B_283) ||
             (ecc_curve == CURVE_B_409) || (ecc_curve == CURVE_B_571) || (ecc_curve == CURVE_K_163))
    {
        Hex2RegEx(private_k, crypto->ECC_K, 1);
    }
    else if ((ecc_curve == CURVE_K_233) || (ecc_curve == CURVE_K_283) ||
             (ecc_curve == CURVE_K_409) || (ecc_curve == CURVE_K_571))
    {
        Hex2RegEx(private_k, crypto->ECC_K, 2);
    }
#endif
    else
    {
        Hex2Reg(private_k, crypto->ECC_K);
    }

    Hex2Reg(public_x, crypto->ECC_X1);
    Hex2Reg(public_y, crypto->ECC_Y1);

    if (z_to_ks)
    {
        ecc_ksctl |= (z_owner << CRYPTO_ECC_KSCTL_OWNER_Pos) | CRYPTO_ECC_KSCTL_WDST_Msk;
    }

    crypto->ECC_KSCTL = ecc_ksctl;

    /* set FSEL (Field selection) */
    if (pCurve->GF == (int)CURVE_GF_2M)
    {
        crypto->ECC_CTL = 0UL;
    }
    else
    {
        /*  CURVE_GF_P */
        crypto->ECC_CTL = CRYPTO_ECC_CTL_FSEL_Msk;
    }

