wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/src/crypto.c
        /*  4-(2) Write 0x1 to Y1 registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_Y1[i] = 0UL;
        }
        crypto->ECC_Y1[0] = 0x1UL;

        /*  4-(3) Write the random integer k to X1 registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_X1[i] = 0UL;
        }
        Hex2Reg(k, crypto->ECC_X1);

        run_ecc_codec(crypto, ECCOP_MODULE | MODOP_DIV, 0);

#if ENABLE_DEBUG
        Reg2Hex(pCurve->Echar, crypto->ECC_X1, temp_hex_str);
        CRYPTO_DBGMSG("(7) output = %s\n", temp_hex_str);
#endif

        /*  4-(8) Read X1 registers to get k^-1 */

        for (i = 0; i < 18; i++)
        {
            temp_result2[i] = crypto->ECC_X1[i];
        }

#if ENABLE_DEBUG
        Reg2Hex(pCurve->Echar, temp_result2, temp_hex_str);
        CRYPTO_DBGMSG("k^-1 = %s\n", temp_hex_str);
#endif

        /*  4-(9) Write the curve order and curve length to N ,M registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_N[i] = 0UL;
        }
        Hex2Reg(pCurve->Eorder, crypto->ECC_N);

        /*  4-(10) Write r, d to X1, Y1 registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_X1[i] = temp_result1[i];
        }

        for (i = 0; i < 18; i++)
        {
            crypto->ECC_Y1[i] = 0UL;
        }
        Hex2Reg(d, crypto->ECC_Y1);

        run_ecc_codec(crypto, ECCOP_MODULE | MODOP_MUL, 0);

#if ENABLE_DEBUG
        Reg2Hex(pCurve->Echar, crypto->ECC_X1, temp_hex_str);
        CRYPTO_DBGMSG("(14) output = %s\n", temp_hex_str);
#endif

        /*  4-(15) Write the curve order to N registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_N[i] = 0UL;
        }
        Hex2Reg(pCurve->Eorder, crypto->ECC_N);

        /*  4-(16) Write e to Y1 registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_Y1[i] = 0UL;
        }
        Hex2Reg(message, crypto->ECC_Y1);

        run_ecc_codec(crypto, ECCOP_MODULE | MODOP_ADD, 0);

#if ENABLE_DEBUG
        Reg2Hex(pCurve->Echar, crypto->ECC_X1, temp_hex_str);
        CRYPTO_DBGMSG("(20) output = %s\n", temp_hex_str);
#endif

        /*  4-(21) Write the curve order and curve length to N ,M registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_N[i] = 0UL;
        }
        Hex2Reg(pCurve->Eorder, crypto->ECC_N);

        /*  4-(22) Write k^-1 to Y1 registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_Y1[i] = temp_result2[i];
        }

        run_ecc_codec(crypto, ECCOP_MODULE | MODOP_MUL, 0);

        /*  4-(27) Read X1 registers to get s */
        for (i = 0; i < 18; i++)
        {
            temp_result2[i] = crypto->ECC_X1[i];
        }

        Reg2Hex(pCurve->Echar, temp_result2, S);

    }  /* ret == 0 */

    return ret;
}

int32_t  ECC_Write_N(CRYPTO_T *crypto, E_ECC_CURVE ecc_curve)
{
    int   i;

    if (ecc_init_curve(crypto, ecc_curve) != 0)
    {
        return -1;
    }
    for (i = 0; i < 18; i++)
    {
        crypto->ECC_N[i] = 0UL;
    }
    Hex2Reg(pCurve->Eorder, crypto->ECC_N);
    return 0;
}
#endif

/**
  * @brief  ECDSA digital signature generation.
  * @param[in]  crypto        Reference to Crypto module.
  * @param[in]  ecc_curve   The pre-defined ECC curve.
  * @param[in]  message     The hash value of source context.
  * @param[in]  d_ksnum     d_ksnum >= 0x80: Use Key Store OTP key number "d_ksnum - 0x80" as input private key
  *                         d_ksnum >= 0:    Use Key Store SRAM key number d_ksnum as input private key
  * @param[in]  k_ksnum     k_ksnum >= 0x80: Use Key Store OTP key number "d_ksnum - 0x80" as input random number
  *                         k_ksnum >= 0:    Use Key Store SRAM key number d_ksnum as input random number
  * @param[out] R           R of the (R,S) pair digital signature
  * @param[out] S           S of the (R,S) pair digital signature
  * @return  0    Success.
  * @return  -1   "ecc_curve" value is invalid.
  */

int32_t  ECC_GenerateSignature_KS(CRYPTO_T *crypto, E_ECC_CURVE ecc_curve, char *message,
                                  int d_ksnum, int k_ksnum, char *R, char *S)
{
    uint32_t volatile temp_result1[18], temp_result2[18];
    uint32_t   ksxy;
    int32_t  	i, ret = 0;

    if (ecc_init_curve(crypto, ecc_curve) != 0)
    {
        ret = -1;
    }

    if (ret == 0)
    {
        /*
         *   1. Calculate e = HASH(m), where HASH is a cryptographic hashing algorithm, (i.e. SHA-1)
         *      (1) Use SHA to calculate e
         */

        /*   2. Select a random integer k form [1, n-1]
         *      (1) Notice that n is order, not prime modulus or irreducible polynomial function
         */

        /*
         *   3. Compute r = x1 (mod n), where (x1, y1) = k * G. If r = 0, go to step 2
         *      (1) Write the curve parameter A, B, and curve length M to corresponding registers
         *      (2) Write the prime modulus or irreducible polynomial function to N registers according
         *      (3) Write the point G(x, y) to X1, Y1 registers
         *      (4) Write the random integer k to K register
         *      (5) Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 00
         *      (6) Set FSEL(CRYPTO_ECC_CTL[8]) according to used curve of prime field or binary field
         *      (7) Set START(CRYPTO_ECC_CTL[0]) to 1
         *      (8) Wait for BUSY(CRYPTO_ECC_STS[0]) be cleared
         *      (9) Write the curve order and curve length to N ,M registers according
         *      (10) Write 0x0 to Y1 registers
         *      (11) Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 01
         *      (12) Set MOPOP(CRYPTO_ECC_CTL[12:11]) to 10
         *      (13) Set START(CRYPTO_ECC_CTL[0]) to 1         *
         *      (14) Wait for BUSY(CRYPTO_ECC_STS[0]) be cleared
         *      (15) Read X1 registers to get r
         */

        /* 3-(4) Write the random integer k to K register */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_K[i] = 0UL;
        }

        if (k_ksnum >= 0x80)
        {
            crypto->ECC_KSCTL = (0x2UL<<CRYPTO_ECC_KSCTL_RSSRCK_Pos) |
                                CRYPTO_ECC_KSCTL_RSRCK_Msk | (k_ksnum - 0x80);
        }
        else
        {
            crypto->ECC_KSCTL = (0<<CRYPTO_ECC_KSCTL_RSSRCK_Pos) |
                                CRYPTO_ECC_KSCTL_RSRCK_Msk | (k_ksnum);
        }

        for (i = 0; i < 18; i++)
        {
            crypto->ECC_X2[i] = 0UL;
        }
        Hex2Reg(pCurve->Eorder, crypto->ECC_X2);

        run_ecc_codec(crypto, ECCOP_POINT_MUL | CRYPTO_ECC_CTL_ECDSAR_Msk, 1);
        crypto->ECC_KSCTL = 0;

        /*  3-(9) Write the curve order to N registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_N[i] = 0UL;
        }
        Hex2Reg(pCurve->Eorder, crypto->ECC_N);

        /* 3-(10) Write 0x0 to Y1 registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_Y1[i] = 0UL;
        }
        printf("second\n");
        run_ecc_codec(crypto, ECCOP_MODULE | MODOP_ADD, 0);

