wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/src/crypto.c
        /*  4-(8) Write the curve order and curve length to N ,M registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_N[i] = 0UL;
        }
        Hex2Reg(pCurve->Eorder, crypto->ECC_N);

        /* 4-(9) Write r, w to X1, Y1 registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_X1[i] = 0UL;
        }
        Hex2Reg(R, crypto->ECC_X1);

        for (i = 0; i < 18; i++)
        {
            crypto->ECC_Y1[i] = temp_result2[i];
        }

        run_ecc_codec(crypto, ECCOP_MODULE | MODOP_MUL, 0);

        /*  4-(14) Read X1 registers to get u2 */
        for (i = 0; i < 18; i++)
        {
            temp_result2[i] = crypto->ECC_X1[i];
        }

#if ENABLE_DEBUG
        Reg2Hex(pCurve->Echar, temp_result2, temp_hex_str);
        CRYPTO_DBGMSG("u2 = %s\n", temp_hex_str);
#endif

        /*
         *   5. Compute X�� (x1��, y1��) = u1 * G + u2 * Q
         *      (1) Write the curve parameter A, B, N, and curve length M to corresponding registers
         *      (2) Write the point G(x, y) to X1, Y1 registers
         *      (3) Write u1 to K registers
         *      (4) Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 00
         *      (5) Set START(CRYPTO_ECC_CTL[0]) to 1
         *      (6) Wait for BUSY(CRYPTO_ECC_STS[0]) be cleared
         *      (7) Read X1, Y1 registers to get u1*G
         *      (8) Write the curve parameter A, B, N, and curve length M to corresponding registers
         *      (9) Write the public key Q(x,y) to X1, Y1 registers
         *      (10) Write u2 to K registers
         *      (11) Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 00
         *      (12) Set START(CRYPTO_ECC_CTL[0]) to 1
         *      (13) Wait for BUSY(CRYPTO_ECC_STS[0]) be cleared
         *      (14) Write the curve parameter A, B, N, and curve length M to corresponding registers
         *      (15) Write the result data u1*G to X2, Y2 registers
         *      (16) Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 10
         *      (17) Set START(CRYPTO_ECC_CTL[0]) to 1
         *      (18) Wait for BUSY(CRYPTO_ECC_STS[0]) be cleared
         *      (19) Read X1, Y1 registers to get X��(x1��, y1��)
         *      (20) Write the curve order and curve length to N ,M registers
         *      (21) Write x1�� to X1 registers
         *      (22) Write 0x0 to Y1 registers
         *      (23) Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 01
         *      (24) Set MOPOP(CRYPTO_ECC_CTL[12:11]) to 10
         *      (25) Set START(CRYPTO_ECC_CTL[0]) to 1
         *      (26) Wait for BUSY(CRYPTO_ECC_STS[0]) be cleared
         *      (27) Read X1 registers to get x1�� (mod n)
         *
         *   6. The signature is valid if x1�� = r, otherwise it is invalid
         */

        /*
         *  (1) Write the curve parameter A, B, N, and curve length M to corresponding registers
         *  (2) Write the point G(x, y) to X1, Y1 registers
         */
        ecc_init_curve(crypto, ecc_curve);

        /* (3) Write u1 to K registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_K[i] = temp_result1[i];
        }

        run_ecc_codec(crypto, ECCOP_POINT_MUL, 0);

        /* (7) Read X1, Y1 registers to get u1*G */
        for (i = 0; i < 18; i++)
        {
            temp_x[i] = crypto->ECC_X1[i];
            temp_y[i] = crypto->ECC_Y1[i];
        }

#if ENABLE_DEBUG
        Reg2Hex(pCurve->Echar, temp_x, temp_hex_str);
        CRYPTO_DBGMSG("5-(7) u1*G, x = %s\n", temp_hex_str);
        Reg2Hex(pCurve->Echar, temp_y, temp_hex_str);
        CRYPTO_DBGMSG("5-(7) u1*G, y = %s\n", temp_hex_str);
#endif

        /* (8) Write the curve parameter A, B, N, and curve length M to corresponding registers */
        ecc_init_curve(crypto, ecc_curve);

        /* (9) Write the public key Q(x,y) to X1, Y1 registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_X1[i] = 0UL;
            crypto->ECC_Y1[i] = 0UL;
        }

        //Hex2Reg(public_k1, crypto->ECC_X1);
        //Hex2Reg(public_k2, crypto->ECC_Y1);

        ksxy = CRYPTO_ECC_KSXY_RSRCXY_Msk;

        if (x_ksnum >= 0x80)
        {
            ksxy |= (2<<CRYPTO_ECC_KSXY_RSSRCX_Pos) | (x_ksnum - 0x80);
        }
        else if (x_ksnum >= 0)
        {
            ksxy |= (0<<CRYPTO_ECC_KSXY_RSSRCX_Pos) | (x_ksnum);
        }
        else
            return -3;

        if (y_ksnum >= 0x80)
        {
            ksxy |= (2<<CRYPTO_ECC_KSXY_RSSRCY_Pos) | ((y_ksnum - 0x80) << 8);
        }
        else if (y_ksnum >= 0)
        {
            ksxy |= (0<<CRYPTO_ECC_KSXY_RSSRCY_Pos) | (y_ksnum << 8);
        }
        else
        {
            return -3;
        }

        printf("Write KSXY 0x%x\n", ksxy);
        crypto->ECC_KSXY = ksxy;

        /* (10) Write u2 to K registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_K[i] = temp_result2[i];
        }

        run_ecc_codec(crypto, ECCOP_POINT_MUL, 0);
        crypto->ECC_KSXY = 0;

        for (i = 0; i < 18; i++)
        {
            temp_result1[i] = crypto->ECC_X1[i];
            temp_result2[i] = crypto->ECC_Y1[i];
        }

#if ENABLE_DEBUG
        Reg2Hex(pCurve->Echar, temp_result1, temp_hex_str);
        CRYPTO_DBGMSG("5-(13) u2*Q, x = %s\n", temp_hex_str);
        Reg2Hex(pCurve->Echar, temp_result2, temp_hex_str);
        CRYPTO_DBGMSG("5-(13) u2*Q, y = %s\n", temp_hex_str);
#endif

        /* (14) Write the curve parameter A, B, N, and curve length M to corresponding registers */
        ecc_init_curve(crypto, ecc_curve);

        /* Write the result data u2*Q to X1, Y1 registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_X1[i] = temp_result1[i];
            crypto->ECC_Y1[i] = temp_result2[i];
        }

        /* (15) Write the result data u1*G to X2, Y2 registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_X2[i] = temp_x[i];
            crypto->ECC_Y2[i] = temp_y[i];
        }

        run_ecc_codec(crypto, ECCOP_POINT_ADD, 0);

        /* (19) Read X1, Y1 registers to get X��(x1��, y1��) */
        for (i = 0; i < 18; i++)
        {
            temp_x[i] = crypto->ECC_X1[i];
            temp_y[i] = crypto->ECC_Y1[i];
        }

#if ENABLE_DEBUG
        Reg2Hex(pCurve->Echar, temp_x, temp_hex_str);
        CRYPTO_DBGMSG("5-(19) x' = %s\n", temp_hex_str);
        Reg2Hex(pCurve->Echar, temp_y, temp_hex_str);
        CRYPTO_DBGMSG("5-(19) y' = %s\n", temp_hex_str);
#endif

        /*  (20) Write the curve order and curve length to N ,M registers */
        for (i = 0; i < 18; i++)
        {
            crypto->ECC_N[i] = 0UL;
        }
        Hex2Reg(pCurve->Eorder, crypto->ECC_N);

