wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/src/crypto.c
    }
    for (i = 0; i < 3; i++)
    {
        crypto->CHAPOLY_NONCE[i] = *(uint32_t *)(&nonce[i * 4]);

    }
    crypto->CHAPOLY_BLOCKCNT = counter;
}


/**
  * @brief  Configure ChaCha DMA source, destination, and source length
  * @param[in]  crypto               The pointer of CRYPTO module
  * @param[in]  u8pInputData         The pointer of DMA source address
  * @param[in]  u8pOutputData        The pointer of DMA destination address
  * @param[in]  src_len              The length of input data
  * @return None
  */
void CHA_SetDMATransfer(CRYPTO_T *crypto, uint8_t* u8pInputData,  uint8_t* u8pOutputData, int src_len)
{
    crypto->CHAPOLY_SADDR = (uint32_t)u8pInputData;
    crypto->CHAPOLY_DADDR = (uint32_t)u8pOutputData;
    crypto->CHAPOLY_CNT = src_len;

    memset(&u8pInputData[src_len], 0, 4);  // for non-4-bytes-aligned do_swap_to

}


/**
  * @brief  Start ChaCha encrypt/decrypt
  * @param[in]  crypto            The pointer of CRYPTO module
  * @param[in]  is_encrypt        The mode of ChaCha operation, only works for AEAD
  * @return None
  */
void CHA_Start(CRYPTO_T *crypto, int is_encrypt)
{
    uint32_t  ctrl = 0;
    g_CHAPOLY_done = 0;

    __DSB();

    if (is_encrypt)
    {
        printf("Is encrypt.\n");
        ctrl |= CRYPTO_CHAPOLY_CTL_ENCRYPTO_Msk;
    }
    else
    {
        printf(" Is decrypt.\n");
    }

    crypto->CHAPOLY_CTL = ctrl | (CHAPOLY_MODE_CHACHA20 << CRYPTO_CHAPOLY_CTL_OPMODE_Pos);

    __DSB();
    crypto->CHAPOLY_CTL |=  CRYPTO_CHAPOLY_CTL_DMAEN_Msk | CRYPTO_CHAPOLY_CTL_START_Msk;

#ifdef ENABLE_INTERRUPT
    while (!g_CHAPOLY_done);
#else
    while (crypto->CHAPOLY_STS & CRYPTO_CHAPOLY_STS_BUSY_Msk);
#endif
}

/**
  * @brief  Set Poly1305 encrypt/decrypt
  * @param[in]  crypto    The pointer of CRYPTO module
  * @param[in]  key       The pointer of the key
  * @return None
  */
void POLY1305_SetKeyandClearNonce(CRYPTO_T *crypto,  unsigned char *key)
{
    int  i;

    memcpy((void*)(crypto->CHAPOLY_KEY), key, 32);
    for (i = 0; i < 8; i++)
    {
        crypto->CHAPOLY_KEY[i] = *(uint32_t *)(&key[i * 4]);
    }
    for (i = 0; i < 3; i++)
        crypto->CHAPOLY_NONCE[i] = 0;
}

/**
  * @brief  Set Poly1305 DMATransfer
  * @param[in]  crypto          The pointer of CRYPTO module
  * @param[in]  u8pInputData    The pointer of input data
  * @param[in]  u8pOutputData   The pointer of output data
  * @param[in]  src_len         The input data length
  * @return None
  */
void POLY1305_SetDMATransfer(CRYPTO_T *crypto, uint8_t* u8pInputData,  uint8_t* u8pOutputData, int src_len)
{
    crypto->CHAPOLY_BLOCKCNT = 0;
    crypto->CHAPOLY_SADDR = (uint32_t)u8pInputData;
    crypto->CHAPOLY_DADDR = (uint32_t)u8pOutputData;
    crypto->CHAPOLY_CNT = src_len;
}

/**
  * @brief  Start Poly1305
  * @param[in]  crypto          The pointer of CRYPTO module
  * @param[in]  u8pInputData    The pointer of input data
  * @return None
  */
void POLY1305_Start(CRYPTO_T *crypto)
{
    uint32_t  ctrl = 0;
    g_CHAPOLY_done = 0;

    __DSB();

    ctrl |= (CHAPOLY_MODE_POLY1305 << CRYPTO_CHAPOLY_CTL_OPMODE_Pos);
    // ctrl |= CRPT_CHAPOLY_CTL_INSWAP_Msk | CRPT_CHAPOLY_CTL_OUTSWAP_Msk;

    crypto->CHAPOLY_CTL = ctrl | CRYPTO_CHAPOLY_CTL_DMAEN_Msk | CRYPTO_CHAPOLY_CTL_DMALAST_Msk | CRYPTO_CHAPOLY_CTL_START_Msk;

#ifdef ENABLE_INTERRUPT
    while (!g_CHAPOLY_done);
#else
    while (CRYPTO->CHAPOLY_STS & CRYPTO_CHAPOLY_STS_BUSY_Msk);
#endif
}

/**
  * @brief  Start Chachapoly AEAD
  * @param[in]  crypto       The pointer of CRYPTO module
  * @return None
  */
void CHAPOLY_Start(CRYPTO_T *crypto)
{
    uint32_t  ctrl = 0;
    g_CHAPOLY_done = 0;

    __DSB();

    ctrl |= ( CHAPOLY_MODE_AEAD<< CRYPTO_CHAPOLY_CTL_OPMODE_Pos);
    // ctrl |= CRPT_CHAPOLY_CTL_INSWAP_Msk | CRPT_CHAPOLY_CTL_OUTSWAP_Msk;

    crypto->CHAPOLY_CTL = ctrl | CRYPTO_CHAPOLY_CTL_DMAEN_Msk | CRYPTO_CHAPOLY_CTL_DMALAST_Msk | CRYPTO_CHAPOLY_CTL_START_Msk;

#ifdef ENABLE_INTERRUPT
    while (!g_CHAPOLY_done);
#else
    while (CRYPTO->CHAPOLY_STS & CRYPTO_CHAPOLY_STS_BUSY_Msk);
#endif
}

/*@}*/ /* end of group CRYPTO_EXPORTED_FUNCTIONS */
/*@}*/ /* end of group CRYPTO_Driver */
/*@}*/ /* end of group Standard_Driver */
